from random import randint
def печать(текст, стиль="", красный=False, зеленый=False,рандомный=False,голубой=False, ярко_оранжевый=False, не_печатать=False):
    def определить_стиль(стиль: str):
            стиль = стиль.lower()
            результат = ""
            if "ж" in стиль:
                результат += ";1"
            if "ч" in стиль:
                результат += ";4"
            if "к" in стиль:
                результат += ";3"
            if "з" in стиль:
                результат += ";9"
            return результат
    итоговый_стиль = определить_стиль(стиль)
    if красный:
        цвет = "255;0;0"
    elif зеленый:
        цвет = "0;255;0"
    elif голубой:
        цвет = "29;172;214"
    elif ярко_оранжевый:
        цвет = "128;128;0"
    elif рандомный:
        результат = ""
        for буква in текст:
            К = randint(0, 255)
            З = randint(0, 255)
            С = randint(0, 255)
            результат += f"\x1B[38;2;{К};{З};{С}{итоговый_стиль}m{буква}"
        результат += "\x1B[0m"
        print(результат)
        return
    else:
        цвет = "255;255;255"
    результат = f"\x1B[38;2;{цвет}{итоговый_стиль}m{текст}\x1B[0m"
    if не_печатать:
        return результат
    print(результат)
if __name__ == "__main__":
    печать("ИСТОРИК ЛЮБИТ ГРИБЫ", рандомный=True, стиль = "жч")
    print("ЧЕРНЫЙ")
    # \x1B[ - особый символ, который вкл. режим другого цвета
    # 38;2; - говорит о том, что след. 3 команды будут в формате RGB
    # после цвета ;1 - особый стиль(в данном случае жирный)
    # \x1B[0m - все, что будет написанно после этого символа будет стандартным цветом. Если не будет этой строчки, все последующие print будут печататься тем же цветом
    красный = печать("abc", красный=True, не_печатать=True)
    зеленый = печать("abc", зеленый=True, не_печатать=True)
    print(f"{красный} и {зеленый}")