Repository: pypi-data/pypi-mirror-348
Catalog: packages/wbcore/wbcore-1.50.15.tar.gz/wbcore-1.50.15/wbcore/contrib/workflow/locale/*/LC_MESSAGES/django.po
Languages: de

source: Invalid status detected!
de: Invalider Status erkannt!

source: Transitions
de: Übergänge

source: Operators
de: Operator

source: Data Types
de: Datentypen

source: Started Before/On
de: Gestartet Vor/Um

source: Started After/On
de: Gestartet Nach/Um

source: Finished Before/On
de: Abgeschlossen Vor/Um

source: Finished After/On
de: Abgeschlossen Nach/Um

source: States
de: Statusse

source: Assignees
de: Verantwortliche

source: Groups
de: Gruppen

source: Permissions
de: Berechtigungen

source: Steps
de: Schritte

source: Processes
de: Prozesse

source: Attached Model
de: Angeheftetes Model

source: Associated Transition
de: Zugehöriger Übergang

source: Step Types
de: Schrittarten

source: Assignee Methods
de: Verantwortlichen-Methoden

source: Template
de: Vorlage

# Email context
source: To
de: An

source: From
de: Von

source: To
de: Zu

source: Associated Condition
de: Zugehörige Bedingung

source: Associated Step
de: Zugehöriger Schritt

source: Associated Data
de: Zugehöriger Datensatz

source: Less Than
de: Weniger

source: Less Than or Equal
de: Weniger Gleich

source: Equal
de: Gleich

source: Greater Than or Equal
de: Größer Gleich

source: Greater Than
de: Größer

source: Transition
de: Übergang

source: Attribute Name
de: Name des Feldes

source: The name of the workflow data or attached model field whose value should be checked
de: Der Name des Feldes aus dem angehefteten Model oder Datensatz, dessen Wert überprüft werden soll

source: Expected Value
de: Erwarteter Wert

source: The expected attribute's value
de: Der erwartete Wert des Feldes

source: Negate Operator
de: Operator Negieren

source: Please call "satisfied" before accessing errors
de: Bitte rufen Sie "satisfied" auf bevor Sie versuchen, auf die Fehler zuzugreifen

source: Condition error: Type of attribute ({}) and expected value ({}) uncompatible or wrong datetime format!
de: Fehler in Bedingung: Typ des Attributs ({}) und erwarteter Wert ({}) inkompatibel oder falsches Datums- bzw. Zeitformat benutzt!

source: Condition error: No attribute called {} found in attached instance or data!
de: Fehler in der Bedingung: Kein Feld namens {} in angehefteter Instanz oder Datensatz gefunden!

source: {} not {} {}
de: {} nicht {} {}

source: Condition
de: Bedingung

source: Conditions
de: Bedingungen

source: Number
de: Zahl

source: Date
de: Datum

source: Date Time
de: Datum und Uhrzeit

source: Boolean
de: Boolesch

source: Label
de: Bezeichnung

source: Help Text
de: Hilfe-Text

source: Data Type
de: Datentyp

source: Required
de: Pflichtfeld

source: Default
de: Standardwert

source: Casting to bool failed.
de: In Boolean Umwandeln fehlgeschlagen.

source: Unsupported target type!
de: Zieltyp wird nicht unterstützt!

source: Date(time) type selected but no date(time) object provided!
de: Datumstyp ausgewählt aber kein Datumsobjekt mitgegeben!

source: Wrong boolean value!
de: Falscher Boolean-Wert!

source: Data
de: Daten

source: Value
de: Wert

source: Process
de: Daten

source: Data Value
de: Datenwert

source: Data Values
de: Datenwerte

source: Grid Fields
de: Gitterfelder

source: Display
de: Darstellung

source: Displays
de: Darstellungen

source: Active
de: Aktiv

source: Finished
de: Beendet

source: Failed
de: Fehlgeschlagen

source: Started
de: Gestartet

source: Instance
de: Instanz

source: Content Type
de: Inhaltsart

source: Preserved Instance
de: Geschützte Instanz

source: State
de: Status

source: The current state of this process. Can be one of: 'Active', 'Finished' or 'Failed'
de: Der derzeitige Status dieses Prozesses. Kann 'Aktiv', 'Beendet' oder 'Fehlgeschlagen' sein

source: Entire process failed due to unreachable steps
de: Gesamter Prozess wegen unerreichbaren Schritten fehlgeschlagen

source: Process {} for workflow {}
de: Prozess {} für Workflow {}

source: Waiting
de: Wartend

source: Canceled
de: Abgebrochen

source: Step
de: Schritt

source: Assignee
de: Verantwortliche*r

source: Group
de: Gruppe

source: Permission
de: Berechtigung

source: The permission needed to be able to view this step being executed.
de: Die Berechtigung, die benötigt wird, um diesen Schritt während seiner Ausführung sehen zu können.

source: The current state of this process step. Can be one of: 'Active', 'Finished', 'Waiting', 'Failed' or 'Canceled'
de: Der derzeitige Status dieses Prozessschrittes. Kann 'Aktiv', 'Beendet', Wartend', 'Fehlgeschlagen' oder 'Abgebrochen' sein

source: Status
de: Statuswert

source: The status that will be set in the attached model upon transitioning to this step
de: Der Status, der im angehefteten Model gesetzt wird, sobald zu diesem Schritt gewechselt wird

source: Error Message
de: Fehlermeldung

source: An error message will be displayed when this step fails
de: Eine Fehlermeldung wird dargestellt, wenn dieser Schritt fehlschlägt

source: Process step {} for step {}
de: Prozessschritt {} für Schritt {}

source: Process Step
de: Prozessschritt

source: Process Steps
de: Prozessschritte

source: Start Step
de: Startschritt

source: User Step
de: Benutzerschritt

source: Decision Step
de: Entscheidungsschritt

source: Split Step
de: Teilungsschritt

source: Join Step
de: Mündungsschritt

source: Email Step
de: Emailschritt

source: Script Step
de: Skriptschritt

source: Finish Step
de: Schlussschritt

source: Step Type
de: Schrittart

source: Define which permission is needed to be able to view this step being executed.
de: Die Berechtigung, um diesen Schritt während er ausgeführt wird, sehen zu können.

source: No valid outgoing transitions found for this step!
de: Keine validen ausgehenden Übergänge für diesen Schritt gefunden!

source: More than one possible outgoing transition found for this step!
de: Mehr als ein möglicher Übergang für diesen Schritt gefunden!

source: Start Steps
de: Startschritte

source: Notify User
de: Benutzer*in Benachrichtigen

source: Assignee Method
de: Verantwortlichen-Methode

source: No assignees selected!
de: Keine Verantwortlichen ausgewählt!

source: Assigned Workflow Step Failed
de: Zugewiesener Workflow Schritt Gescheitert

source: A workflow step you were assigned to just failed with the error message '{}'. Please take appropriate action.
de: Ein Workflow Schritt, dem Sie zugewiesen waren, ist gerade mit der Fehlermeldung '{}' fehlgeschlagen. Bitte verfahren Sie angemessen.

source: Workflow Step Awaiting Your Decision
de: Workflow Schritt Wartet auf Ihre Entscheidung

source: You were assigned to a workflow step. Please select the next step.
de: Sie wurden einem Workflow Schritt zugewiesen. Bitte wählen Sie den nächsten Schritt.

source: User Steps
de: Benutzerschritte

source: Workflow Step Assignment Notification
de: Workflow Schritt Zuweisungsbenachrichtigung

source: Notification for all assigned users that can transition a workflow step to the next step
de: Benachrichtigung für alle zugewiesenen Benutzer*innen, die den nächsten Workflow Schritt auswählen können

source: Failed Workflow Step Notification
de: Fehlgeschlagener Workflow Schritt Benachrichtigung

source: Notification for all assigned users of a failed workflow step
de: Benachrichtigung für alle zugewiesenen Benutzer*innen eines fehlgeschlagenen Workflow Schrittes

source: No valid outgoing transition found for this step!
de: Kein valider ausgehender Übergang für diesen Schritt gefunden!

source: Decision Steps
de: Entscheidungsschritte

source: Split Steps
de: Teilungsschritte

source: Wait For All
de: Auf Alle Warten

source: If False, will cancel all other incoming process steps as soon the first reaches this step.
de: Wenn falsch, bricht alle anderen eingehenden Prozessschritte ab, sobald der erste diesen Schritt erreicht.

source: Join Steps
de: Mündungsschritte

source: Script
de: Skript

source: Executing script failed: {}
de: Ausführung des Skripts fehlgeschlagen: {}

source: Script Steps
de: Skriptschritte

source: Subject
de: Betreff

source: Error in template syntax!
de: Fehler in Syntax der Vorlage!

source: Email Steps
de: Emailschritte

source: Write Preserved Instance
de: Geschützte Instanz Speichern

source: Writes the instance data backup onto the instance restoring its state to the beginning of the workflow.
de: Überschreibt die momentane Instanz mit den Daten der gesicherten Instanz, sodass diese wieder in ihren Zustand zu Beginn des Workflows versetzt wird.

source: There are process steps still running for this workflow!
de: Es gibt noch laufende Prozessschritte in diesem Workflow!

source: Finish Steps
de: Schlussschritte

source: Icon
de: Symbol

source: No instance or data attached!
de: Keine Instanz oder Daten angehängt!

source: Single Instance Execution
de: Einzelausführung der Instanz

source: Indicates wether the workflow is restricted to only one running process per workflow or attached model instance
de: Gibt an, ob der Workflow beschränkt ist auf nur einen laufenden Prozess pro Workflow oder angehefteter Model-Instanz

source: Status Field
de: Status-Feld

source: The status field name in the corresponding model that needs to be updated by the workflow
de: Der Name des Status-Feldes im angehefteten Model, das vom Workflow aktualisiert werden soll

source: Preserve Instance
de: Instanz Schützen

source: This will preserve the attached instance's state in a JSON field when starting the workflow. You then have the option to write this data back onto the instance in a finish step, effectively preserving the instance's state throughout the workflow.
de: Dies würde alle Daten der angehefteten Instanz in einem JSON-Feld speichern, sobald der Workflow gestartet wird. Der*Die Benutzer*in hat dann die Möglichkeit, diese Daten in einem Schlussschritt wieder in der Instanz zu speichern, wodurch die Instanz vor Änderungen durch den Workflow geschützt wird.

source: if {} {} {}
de: wenn {} {} {}

source: This condition for the selected transition already exists.
de: Diese Bedingung existiert bereits für den ausgewählten Übergang.

source: Related workflow needs to have a model or data attached.
de: Zugehöriger Workflow muss ein Model oder Datensatz angeheftet haben.

source: A field with this name already exists in the process step model.
de: Ein Feld mit diesem Namen existiert bereits im Prozessschritt Model.

source: A data object with this label was already created for the selected workflow.
de: Ein Datenobjekt mit dieser Bezeichnung wurde bereits für den ausgewählten Workflow erstellt.

source: Cannot set both required and a default value.
de: Kann nicht gleichzeitig als Pflichtfeld deklariert und ein Standardwert angegeben werden.

source: Invalid default value for this data type. Please use a date formatted to 'day.month.year'.
de: Ungültiger Standardwert für diesen Datentyp. Bitte nutzen Sie ein Datum mit der Formatierung 'Tag.Monat.Jahr'.

source: Invalid default value for this data type. Please use a datetime formatted to 'day.month.year hour:minute:second' in the 24h format.
de: Ungültiger Standardwert für diesen Datentyp. Bitte nutzen Sie eine Datum- und Zeitangabe mit der Formatierung 'Tag.Monat.Jahr Stunde:Minute:Sekunde' im 24h-Format.

source: Invalid default value for this data type.
de: Ungültiger Standardwert für diesen Datentyp.

source: Invalid value for this data type. Please use a date formatted to 'day.month.year'.
de: Ungültiger Wert für diesen Datentyp. Bitte nutzen Sie ein Datum mit der Formatierung 'Tag.Monat.Jahr'.

source: Invalid value for this data type. Please use a datetime formatted to 'day.month.year hour:minute:second' in the 24h format.
de: Ungültiger Wert für diesen Datentyp. Bitte nutzen Sie eine Datum- und Zeitangabe mit der Formatierung 'Tag.Monat.Jahr Stunde:Minute:Sekunde' im 24h-Format.

source: Invalid value for this data type.
de: Ungültiger Wert für diesen Datentyp.

source: Are you sure you want to activate {}?
de: Sind Sie sich sicher, dass Sie {} aktivieren wollen?

source: Activating {}
de: Aktiviere {}

source: You need to set a workflow.
de: Sie müssen einen Workflow setzen.

source: Name has to be unique for the specified workflow.
de: Name muss einzigartig für den Workflow sein.

source: Code has to be unique for the specified workflow.
de: Code muss einzigartig für diesen Workflow sein.

source: You need to specify a status for a workflow with an attached model. If no model is attached, do not specify a status.
de: Bei einem Workflow mit angehefteter Instanz müssen Sie ein Status-Feld angeben.

source: Please select either an assignee or a group. Do not select both.
de: Bitte wählen Sie entweder eine*n Verantwortliche*n oder eine Gruppe, aber nicht beides beides.

source: Please do not select both an assignee and a method.
de: Bitte wählen Sie nicht gleichzeitig eine*n Verantwortliche*n und eine Methode aus.

source: None of the selected assignees/group members has this permission. Please assign the permission to one of the users or choose a different one.
de: Keiner der ausgewählten verantwortlichen Personen/Gruppen hat diese Erlaubnis. Bitte weisen Sie diese Erlaubnis einem der Nutzerprofile zu oder wählen Sie eine andere.

source: Duplicate E-Mails in 'To' and 'CC'.
de: Duplikate E-Mail-Adressen in 'An' und 'CC'.

source: Duplicate E-Mails in 'To' and 'BCC'.
de: Doppelte E-Mail-Adressen in 'An' und 'BCC'.

source: Duplicate E-Mails in 'CC' and 'BCC'.
de: Doppelte E-Mail-Adressen in 'CC' und 'BCC'.

source: Cannot write preserved instance without picking the option to preserve it when creating the workflow.
de: Kann die geschützte Instanz nicht speichern ohne vorher im Workflow die Option, die Instanz zu schützen, ausgewählt zu haben.

source: All steps need to belong to the same workflow.
de: Alle Schritte müssen zu demselben Workflow gehören.

source: Cannot transition to the same step. Please set different preceding and succeeding steps.
de: Kann nicht zum selben Schritt übergehen. Bitte setzen Sie unterschiedliche vorangegangene und nachfolgende Schritte.

source: Cannot set a finishing step at the start of a transition.
de: Kann keinen Schlussschritt für den Anfang eines Übergangs benutzen.

source: A transition with this name to the same succeeding step already exists.
de: Ein Übergang mit diesem Namen zum selben Schritt existiert bereits.

source: Start {}
de: {} Starten

source: Are you sure you want to start workflow {}?
de: Sind Sie sich sicher, dass Sie den Workflow {} starten wollen?

source: Starting {}
de: Starte {}

source: Can only preserve the instance when a model is attached.
de: Instanz nicht zum Schützen verfügbar wenn kein Model angeheftet ist.

source: Model not found.
de: Model nicht gefunden.

source: This model does not implement the specified status field.
de: Dieses Model implementiert das spezifizierte Status-Feld nicht.

source: New Step
de: Neuer Schritt

source: New Start Step
de: Neuer Startschritt

source: New User Step
de: Neuer Benutzerschritt

source: New Decision Step
de: Neuer Entscheidungsschritt

source: New Split Step
de: Neuer Teilungsschritt

source: New Join Step
de: Neuer Mündungsschritt

source: New Script Step
de: Neuer Skriptschritt

source: New Email Step
de: Neuer E-Mail-Schritt

source: New Finish Step
de: Neuer Schlussschritt

source: Model Status Field
de: Model Status-Feld

source: Create Condition
de: Bedingung Erstellen

source: Create Data
de: Daten Erstellen

source: Create Start Step
de: Startschritt Erstellen

source: Create User Step
de: Benutzerschritt Erstellen

source: Create Decision Step
de: Entscheidungsschritt Erstellen

source: Create Split Step
de: Teilungsschritt Erstellen

source: Create Join Step
de: Mündungsschritt Erstellen

source: Create Script Step
de: Skriptschritt Erstellen

source: Create Email Step
de: Emailschritt Erstellen

source: Create Finish Step
de: Schlussschritt Erstellen

source: Create Transition
de: Übergang Erstellen

source: Create Workflow
de: Workflow Erstellen

source: Assigned Process Steps
de: Zugewiesene Prozessschritte

source: Assigned Process Step
de: Zugewiesener Prozessschritt

source: Create Step
de: Schritt Erstellen

source: Error in assignee method: Incorrect input in kwargs field!
de: Fehler in Verantwortlichen-Methode: Inkorrekter Input im Kwargs-Feld!

source: Error in assignee method: No populated group to pick assignee from selected!
de: Fehler in Verantwortlichen-Methode: Keine Gruppe mit Benutzer*innen, aus denen der*die Verantwortliche gezogen werden kann, wurde ausgewählt!
