from setuptools import setup

setup(
    name="stalin", # имя модуля, которое будет использоваться при установке через pip install
    version="0.1", # версия модуля. При каждом обновлении её надо увеличивать
    description="Мои личные инструменты", # описание проекта, его можно не использовать
    packages=["stalin"], # список с названиями папок, которые нужно залить
    author_email="kolomna.student.8122@gmail.com", # почти автора
    zip_safe=False, # пароль, можно не указывать 
    install_requires = [], # список дополнительных модулей, которые необходимы для использования вашего модуля
)