Repository: pypi-data/pypi-mirror-348
Catalog: packages/wbcrm/wbcrm-1.50.15-py2.py3-none-any.whl/wbcrm/locale/*/LC_MESSAGES/django.po
Languages: de

source: Create Activity Type
de: Aktivitätstyp Erstellen

source: Create Activity
de: Aktivität Erstellen

source: Activity Chart
de: Aktivitätendiagramm

source: Create Groups
de: Gruppe Erstellen

source: Create Product
de: Produkt erstellen

source: This is a recurring occurrence with period {repeat_choice}
de: Dies ist eine wiederkehrende Aktivität mit der Wiederholungsrate {repeat_choice}

source: New Activity Type
de: Neuer Aktivitätstyp

source: Activity: {{title}}
de: Aktivität: {{title}}

source: Delete Private Activity
de: Löschen von Privater Aktivität

source: Delete Confidential Activity
de: Löschen von Vertraulicher Aktivität

source: Delete Activity: {{title}}
de: Lösche Aktivität: {{title}}

source: Activities for {person}
de: Aktivitäten für {person}

source: Activities for Multiple Persons
de: Aktivitäten für mehrere Personen

source: Activities for {company}
de: Aktivitäten für {company}

source: New Activity for {entry}
de: Neue Aktivität für {entry}

source: New Activity
de: Neue Aktivität

source: Add Product
de: Produkt Hinzufügen

source: Customer Statuses
de: Kundenstatus

source: New Customer Status
de: Neuer Kundenstatus

source: Customer Status
de: Kundenstatus

source: Company Positions
de: Unternehmenspositionen

source: New Company Position
de: Neue Unternehmensposition

source: Company Position
de: Unternehmensposition

source: Company Types
de: Unternehmenstypen

source: New Company Type
de: Neuer Unternehmenstyp

source: Company Type
de: Unternehmenstyp

source: Specializations
de: Spezialisierungen

source: New Specialization
de: Neue Spezialisierung

source: Specialization
de: Spezialisierung

source: Assignee has no user account!
de: Verantwortliche*r hat keinen User Account!

source: No activity attached!
de: Keine Aktivität angeheftet!

source: Error in assignee method: {}
de: Fehler in Verantwortlichen-Methode: {}
