Repository: pypi-data/pypi-mirror-348
Catalog: packages/wbcrm/wbcrm-1.50.15-py2.py3-none-any.whl/wbcrm/locale/*/LC_MESSAGES/django.po
Languages: de

source: Main information
de: Hauptinformationen

source: Temporal Information
de: Temporale Informationen

source: Geographical Information
de: Geografische Informationen

source: Linked Entries
de: Verbundene Einträge

source: Linked Activities
de: Verbundene Aktivitäten

source: Recurrence
de: Wiederkehrende Aktivitäten

source: Check for mandatory participants
de: Nach Pflichtteilnehmer*innen prüfen

source: Determines whether or not companies must be entered as participants in the "Companies" field for activities.
de: Legt fest, ob bei Aktivitäten Unternehmen im Feld „Unternehmen“ als Teilnehmer eingetragen werden müssen oder nicht.

source: The default Maximum allowed days
de: Die Standard maximal erlaubten Tage

source: Types
de: Typen

source: Visibility
de: Zugriffsbeschränkung

source: Participants
de: Teilnehmer*innen

source: Companies
de: Unternehmen

source: Groups
de: Gruppen

source: Clients of
de: Kund*innen von

source: Latest Reviewers
de: Letzte Prüfer*innen

source: Importance
de: Priorität

source: Created
de: Erstellt Am

source: Edited
de: Zuletzt Bearbeitet

source: Only Recent
de: Nur Neue

source: Multipliers
de: Multiplikatoren

source: Is occupied by different activity
de: Ist beschäftigt mit einer anderen Aktivität

source: Members
de: Mitglieder*innen

source: Prospects
de: Interessent*innen

source: Is Competitor
de: Ist Konkurrenz

source: No Activity
de: Keine Aktivität

source: Last Month
de: Letzter Monat

source: Last 3 Months
de: Letzten 3 Monate

source: Last 6 Months
de: Letzten 6 Monate

source: Last 12 Months
de: Letzten 12 Monate

source: All Time
de: Durchgehend

source: Activity Type
de: Aktivitätstyp

source: Only Internal
de: Nur Intern

source: Only External
de: Nur Extern

source: All
de: Alle

source: Participants of Activity
de: Teilnehmer*innen der Aktivität

source: Activities considered are related to the participants
de: Berücksichtigte Aktivitäten gehören zu den Teilnehmer*innen

source: Creator of activity
de: Der*Die Ersteller*in dieser Aktivität

source: Activities considered are related to the creator
de: Die berücksichtigten Aktivitäten gehören zu dem*der Ersteller*in

source: Person Assigned
de: Hauptverantwortliche Person

source: Activities considered are related to the persons assigned
de: Die berücksichtigten Aktivitäten gehören zur hauptverantwortlichen Person

source: Number of Activities
de: Anzahl der Aktivitäten

source: Activity Type: {types}
de: Aktivitätstyp: {types}

source: Activity Area: {area}
de: Aktivitätsbereich: {area}

source: Person Participates: {participating}
de: Person Nimmt Teil: {participating}

source: Person Created: {created}
de: Person Erstellt: {created}

source: Person Assigned: {assigned}
de: Hauptverantwortliche Person: {assigned}

source: Parameters
de: Parameter

source: Pending
de: Ausstehend

source: Open
de: Offen

source: Close
de: Schließen

source: Parent Account
de: Elternkonto

source: Owner
de: Eigentümer*in

source: Account
de: Konto

source: Accounts
de: Konten

source: authorized Hidden Users
de: Autorisierte Versteckte Benutzer*innen

source: List of users that are allowed to see this hidden account role
de: Liste von Benutzer*innen, die diese versteckte Kontofunktion sehen dürfen

source: Title
de: Titel

source: Activity Heat Multiplier
de: Aktivitätsscore Multiplikator

source: Used for the activity heat calculation. Multipliers range from low (i.e. e-mail) to medium (i.e. call) and high (i.e. meeting).
de: Wird für die Berechnung des Aktivitätenscores verwendet. Multiplikatoren reichen von niedrig (z.B. E-Mail) über mittel (z.B. Anruf) bis hoch (z.B. Meeting).

source: Activity Types
de: Aktivitätstypen

source: Check this if it happens online
de: Wähle diese Option aus, wenn diese Aktivität Online stattfindet

source: Cancelled
de: Abgesagt

source: Planned
de: Geplant

source: Finished
de: Beendet

source: Reviewed
de: Geprüft

source: Low
de: Niedrig

source: Medium
de: Mittel

source: High
de: Hoch

source: Never
de: Niemals

source: At time of event
de: Zum Startzeitpunkt

source: 5 minutes before
de: 5 Minuten davor

source: 15 minutes before
de: 15 Minuten davor

source: 30 minutes before
de: 30 Minuten davor

source: 1 hour before
de: 1 Stunde davor

source: 2 hour before
de: 2 Stunden davor

source: 12 hour before
de: 12 Stunden davor

source: 1 week before
de: Eine Woche davor

source: Activity
de: Aktivität

source: Activities
de: Aktivitäten

source: Activity Participant
de: Teilnahme an Aktivität

source: User notification when addeded to an activity.
de: Nutzer-Benachrichtigung bei Hinzufügen zu einer Aktivität.

source: Activity Reminder
de: Aktivitätserinnerung

source: Sends a reminder that an activity is starting soon.
de: Sendet eine Erinnerung, dass eine Aktivität bald beginnt.

source: Finished Activity
de: Beendete Aktivität

source: Notifies a user of a finished activity that can be reviewed.
de: Benachrichtigt eine*n Benutzer*in über eine abgeschlossene Aktivität die geprüft werden kann.

source: Daily Summary
de: Tagesausblick

source: Sends out a daily summary of a user's upcoming day.
de: Sendet einen Tagesausblick für den bevorstehenden Tag eine*s*r Benutzer*s*in.

source: Activity Sync Irregularities
de: Aktivitäts-Sync Irregularitäten

source: Admin notification to inform about irregularities of the activity sync.
de: Admin-Benachrichtigung, um über Irregularitäten mit der Aktivitäts-Synchroniserung zu informieren.

source: Finish
de: Beenden

source: Are you sure you want to finish this activity?
de: Sind Sie sich sicher, dass Sie diese Aktivität beenden wollen?

source: In this status this has to be provided.
de: In diesem Status muss dies ausgefüllt werden.

# Transition button label for Reviews
source: Review
de: Ergebnis Schreiben

# Transition action label for Reviews
source: Review
de: Ergebnis Schreiben

source: When reviewing an activity a result has to be provided!
de: Um eine Aktivität zu prüfen müssen Sie ein Fazit schreiben!

source: You need to enter an employer for {persons}
de: Für {persons} wurde noch kein*e Arbeitgeber*in angegeben

source: You need to enter an employee for {companies}
de: Für {companies} wurde noch kein*e Angestellte*r angegeben

source: Cancel
de: Absagen

source: Are you sure you want to cancel this activity?
de: Sind Sie sich sicher, dass Sie diese Aktivität absagen wollen?

source: Description
de: Beschreibung

source: Review
de: Ergebnis

source: Type
de: Typ

source: End
de: Ende

source: Sends a mail and system notification to all participating internal employees before the start of the activity.
de: Sendet eine Mail- und System-Benachrichtigung an alle teilnehmenden internen Angestellt*innen vor dem Start der Aktivität.

source: Location
de: Standort

source: Longitude
de: Längengrad

source: Latitude
de: Breitengrad

source: Creator
de: Ersteller*in

source: The creator of this activity
de: Der*Die Ersteller*in dieser Aktivität

source: Latest Reviewer
de: Letzte*r Prüfer*in

source: The latest person to review the activity
de: Die letzte Person, die diese Aktivität geprüft hat

source: Reviewed at
de: Überprüft Am

source: Assigned to
de: Hauptverantwortliche*r

source: The person in charge of handling this activity
de: Die hauptverantwortliche Person für diese Aktivität

source: Participating Persons
de: Teilnehmende Personen

source: The list of participants
de: Die Liste der teilnehmenden Personen

source: Participating Companies
de: Teilnehmende Unternehmen

source: The list of companies participating
de: Die Liste der teilnehmenden Unternehmen

source: Each member of the group will be added to the list of participants and companies automatically.
de: Jedes Mitglied der Gruppe wird automatisch zur Liste von Teilnehmer*innen und Unternehmen hinzugefügt.

source: Preceded by
de: Vorausgegange Aktivität

source: The preceding activity
de: Die vorausgegange Aktivität

source: Without Participating Company
de: Ohne Unternehmen als Teilnehmer

source: You did not supply an employer for {persons}<br />
de: Für {persons} wurde noch kein*e Arbeitgeber*in angegeben<br />

source: You did not supply an employee for {companies}<br />
de: Für {companies} wurde noch kein*e Angestellte*r angegeben<br />

source: <br /><strong>You will not be able to review this activity until you fix all issues mentioned above (Or disable the check below).</strong>
de: <br /><strong>Sie werden nicht in der Lage sein, diese Aktivität zu prüfen bevor Sie nicht die oben erwähnten Probleme beseitigt haben (oder Sie wählen die Option "Ohne Unternehmen als Teilnehmer" aus ).</strong>

source: Period needs to be set for recurrence to work!
de: Zeitrahmen muss gesetzt sein, damit wiederkehrende Aktivitäten funktionieren können!

source: starting at the {} at {}
de: am {} um {}

source: {} added you
de: {} hat Sie

source: You were automatically added
de: Sie wurden automatisch

source: {} as participant in a {}{}
de: {} als Teilnehmer*in in eine*r*m {}{} hinzugefügt

source: Maybe
de: Vielleicht

source: Attends
de: Nimmt Teil

source: Not Responded
de: Nicht Geantwortet

source: Attends Digitally
de: Nimmt digital teil

source: Participant
de: Teilnehmer*in

source: Participation Status
de: Teilnahmestatus

source: Status of {participant} for activity {title} is: {status}
de: Der Status von {participant} für die Aktivität {title} ist: {status}

source: Activity's Participant
de: Teilnehmer*in einer Aktivität

source: Activities' Participants
de: Teilnehmer*innen von Aktivitäten

source: Setting Maybe
de: Auf "Vielleicht" Setzen

source: Accept
de: Zusagen

source: Accepting
de: Zusage

source: Are you sure you want to participate in this activity?
de: Sind Sie sich sicher, dass Sie an dieser Aktivität teilnehmen wollen?

source: Attend Digitally
de: Digital Teilnehmen

source: Setting Attendance
de: Teilnahme Setzen

source: Are you sure you want to attend digitally in this activity?
de: Sind Sie sich sicher, dass Sie an dieser Aktivität digital teilnehmen wollen?

source: Decline
de: Absagen

source: Are you sure you want to decline to participate in this activity?
de: Sind Sie sich sicher, dass Sie an dieser Aktivität nicht teilnehmen wollen?

source: Resend Invitation
de: Einladung Erneut Senden

source: Resending Invitation
de: Erneutes Senden der Einladung

source: Are you sure you want to send this person an invitation to participate in this activity again?
de: Sind Sie sich sicher, dass Sie dieser Person noch einmal eine Einladung zur Aktivität schicken wollen?

source: Group
de: Gruppe

source: Product
de: Produkt

source: Company
de: Unternehmen

source: Company-Product Relationship
de: Unternehmen-Produkt-Beziehung

source: Company-Product Relationships
de: Unternehmen-Produkt-Beziehungen

source: Indicates wether this is a competitor's product
de: Gibt an, ob es sich um ein Konkurrenz-Produkt handelt

source: The list of prospects
de: Die Liste der Interessent*innen

source: {} (Competitor)
de: {} (Konkurrenz)

source: Products
de: Produkte

source: Business Daily
de: Arbeitstäglich

source: Daily
de: Täglich

source: Weekly
de: Wöchentlich

source: Bi-Weekly
de: Zweiwöchentlich

source: Monthly
de: Monatlich

source: Quarterly
de: Quartalsweise

source: Annually
de: Jährlich

source: Parent Activity
de: Ausgangsaktivität

source: Propagate for all following activities?
de: Auch auf alle Folgeaktivitäten anwenden?

source: If this is checked, changes will be propagated to the following activities.
de: Wenn Sie diese Option auswählen, werden alle Änderungen auch an den Folgeaktivitäten durchgeführt.

source: Exclude occurrence from propagation?
de: Dieses Ereignis von übertragenen Änderungen ausschließen?

source: If this is checked, changes will not be propagated on this activity.
de: Wenn Sie diese Option auswählen, werden Änderungen durch vorherige Aktivitäten nicht durchgeführt.

source: Date
de: Datum

source: Specifies until when an event is to be repeated. Is mutually exclusive with the Recurrence Count.
de: Legt fest, bis zu welchem Datum eine Aktivität wiederholt werden soll. Dies schließt sich gegenseitig mit der Option für die Anzahl an Wiederholungen aus.

source: Count
de: Anzahl

source: Specifies how often an activity should be repeated excluding the original activity. Is mutually exclusive with the end date. Limited to a maximum of 365 recurrences.
de: Gibt an, wie oft eine Aktivität unter Ausschluss der ursprünglichen Aktivität wiederholt werden soll. Schließt sich gegenseitig mit dem Enddatum aus. Begrenzt auf maximal 365 Wiederholungen.

source: Recurrence Frequency
de: Wiederholungsfrequenz

source: Repeat activity at the specified frequency
de: Wiederholung der Aktivität in der angegebenen Häufigkeit

source: all
de: alle

source: Duration (hours)
de: Dauer (in Stunden)

source: Cannot add a duplicate activity type.
de: Dieser Aktivitätstyp existiert bereits.

source: Private Activity
de: Private Aktivität

source: Confidential Activity
de: Vertrauliche Aktivität

source: Recurrence End
de: Ende der Wiederholung

source: Set to private for the activity to hide sensitive information from anyone but the assignee and participants. Set to confidential to hide from anyone but users with manager permissions.
de: Auf privat setzen, wenn die sensitiven Informationen der Aktivität nur dem*der Verantwortlichen und den Teilnehmern angezeigt werden sollen. Auf vertraulich setzen, um die sensitiven Informationen nur Nutzern mit Manager-Berechtigungen anzuzeigen.

source: Period
de: Zeitrahmen

source: Followed by
de: Gefolgt von

source: Please add an activity type.
de: Bitte geben Sie den Typ für diese Aktivität an.

source: A private activity already uses this conference room at the same time.
de: Der Konferenzraum wird zur gleichen Zeit bereits von einer privaten Aktivität belegt.

source: A confidential activity already uses this conference room at the same time.
de: Der Konferenzraum wird zur gleichen Zeit durch eine vertrauliche Aktivität belegt.

source: The activity "{title}" already uses this conference room at the same time.
de: Der Konferenzraum wird zur gleichen Zeit durch die Aktivität "{title}" belegt.

source: is a member
de: ist ein Mitglied

source: and
de: und

source: are members
de: sind Mitglieder*innen

source: {missing_members} {util_str} of the group: {groups} . You cannot remove members of selected groups.
de: {missing_members} {util_str} der Gruppe: {groups} . Sie dürfen keine Gruppenmitglieder von bereits ausgewählten Gruppen entfernen.

source: Primary Telephone
de: Primäre Telefonnummer

source: Primary Email
de: Primäre Email

source: The person is already a participant in this activity.
de: Die Person ist bereits ein*e Teilnehmer*in in dieser Aktivität.

source: competitor
de: Konkurrenz-

source: Cannot add a duplicate {}product.
de: Ein doppeltes {}Produkt kann nicht erstellt werden.

source: Please provide a valid timeframe.
de: Bitte geben Sie einen gültigen Zeitrahmen an.

source: You can only pick either a recurrence count or an end date but not both.
de: Sie müssen entweder ein Enddatum auswählen oder die Anzahl an Wiederholungen festlegen, nicht beides.

source: The "Repeat Until" date needs to be after the "Recurrence Start" date.
de: Das "Wiederhole Bis" - Datum muss nach dem Startdatum liegen.

source: Period must correspond to the recurrence 'Business Daily'
de: Zeitrahmen muss zur Wiederholungsrate 'Arbeitstäglich' passen

source: It is only possible to change the time of the period of an occurrence.
de: Es ist nur möglich, die Zeit eines wiederkehrenden Ereignisses zu ändern.

source: Call with {name}
de: Telefonat mit {name}

source: Operation completed, we have set the webhook for {} users.
de: Operation abgeschlossen, der Webhook wurde für {} Benutzer*innen gesetzt.

source: Operation Failed, {}
de: Operation fehlgeschlagen, {}

source: Operation completed, we have stopped the webhook for {} users.
de: Operation abgeschlossen, der Webhook wurde für {} Benutzer*innen gestoppt.

source: Operation completed, we checked the webhook for {} users.
de: Operation abgeschlossen, der Webhook wurde für {} Benutzer*innen überprüft.

source: Notify admins of event webhook inconsistencies - {}
de: Admins über Webhook-Unstimmigkeiten Aufklären - {}

source: The Google credentials are not set. You cannot use the Google Calendar Backend without the Google credentials.
de: Die Anmeldeinformationen für Google wurden nicht gesetzt. Sie können den Google Kalender Backend nicht ohne die Daten zur Anmeldung nutzen.

source: Could not create the Google service. Exception:
de: Konnte den Google Service nicht erstellen. Fehlermeldung:

source: Could not create the external google event. Exception:
de: Konnte das externe Google Event nicht erstellen. Fehlermeldung:

source: Could not delete a corresponding external event. Exception:
de: Konnte ein externes Event nicht löschen. Fehlermeldung:

source: Could not update the external google-event. Exception:
de: Konnte das externe Google Event nicht aktualisieren. Fehlermeldung:

source: Could not update the participation status on the google-event. Exception:
de: Konnte den Teilnahmestatus des Google Events nicht aktualisieren. Fehlermeldung:

source: Couldn't sync with google calendar. Exception:
de: Konnte nicht mit Google Kalender synchronisieren. Fehlermeldung:

source: Could not set the google web hook for the user:
de: Konnte den Google Webhook nicht setzen für Benutzer*in:

source: Timestamp valid until:
de: Zeitstempel gültig bis:

source: No valid web hook found
de: Kein gültiger Webhook gefunden

source: Outlook TenantId not found for:
de: Outlook Tenant ID nicht gefunden für:

source: has no active webhook
de: hat keinen aktiven Webhook

source: Webhook is invalid, Remove or Stop it and Set again please.
de: Webhook ist ungültig, bitte entfernen oder stoppen und dann neu setzen.

source: Webhook not found.
de: Webhook nicht gefunden.

source: Number of subscriptions found in outlook for {} out of the total number: {}/{}.
de: Anzahl an Outlook-Abonnements für {} aus der gesamten Anzahl: {}/{}.

source: TenantId not found for
de: Tenant ID nicht gefunden für

source: <li>No Call Record subscription found in Microsoft</li>
de: <li>Kein Abonnement für Rufdatenaufzeichnung in Microsoft gefunden</li>

source: <li>Number of calendar subscription not found in our system : <b>{}</b></li> <p>{}</p> <li>Number of calendar subscription assumed to be active not found in outlook: <b>{}</b></li> <p>{}</p>
de: <li>Anzahl an Kalender Abonnements nicht im System gefunden : <b>{}</b></li> <p>{}</p> <li>Anzahl an Kalender Abonnements, die aktiv erwartet waren nicht in Outlook gefunden: <b>{}</b></li> <p>{}</p>

source: Synchronization Backend Calendar
de: Synchronisation Backend-Kalender

source: The Backend Calendar to synchronize activities with an external calendar.
de: Der Backend-Kalender zum Synchronisieren von Aktivitäten mit einem externen Kalender.

source: Synchronization Past Activity
de: Synchronisierung Beendeter Aktivitäten

source: Cancel Internal Activity Instead Of Deleting
de: Interne Aktivität Absagen Statt Löschen

source: When an activity is deleted in an external calendar the corresponding workbench activity can be cancelled (default) or also deleted.
de: Wenn eine Aktivität in einem externen Kalender gelöscht wird, kann die zugehörige Workbench Aktivität abgesagt (Standard) oder gelöscht werden.

source: Cancel External Activity With One Non-Attending Internal Participant
de: Externe Aktivität mit Einzelnem Internen Nicht-Teilnehmenden Absagen

source: When an activity was created by an external person and has only one internal participant the activity in the workbench can be canceled if this participant doesn't choose to attend.
de: Wenn eine Aktivität von einer externen Person erstellt wurde und nur eine*n interne*n Teilnehmer*in hat, wird die Aktivität in der Workbench abgesagt wenn diese*r Teilnehmer*in absagt.

source: Synchronize Activity Description
de: Aktivitätsbeschreibung Synchronisieren

source: Synchronize External Participants From Internal Calendar To External Calendar
de: Externe Teilnehmer*innen Vom Internen Zum Externen Kalender Synchronisieren

source: Google Synchronization Credentials
de: Google Synchronisation Anmeldedaten

source: Outlook Synchronization Credentials
de: Outlook Synchronisation Anmeldedaten

source: Microsoft Graph Access Token
de: Microsoft Graph Zugangstoken

source: The access token obtained from subscriptions to Microsoft used for authentication pruposes
de: Das durch Microsoft Abonnements erhaltene Zugangstoken dient für Authentifizierungszwecke

source: Microsoft Graph Webhook Secret Client State
de: Microsoft Graph Webhook Geheimer Klientenstatus

source: Secret Client Value defined during subscription, it will be injected into the webhook notification against spoofing
de: Geheimer Wert, der während des Abonnements definiert wurde und in die Webhook-Benachrichtigung gegen Spoofing eingespeist wird

source: {type} in {reminder} Minutes
de: {type} in {reminder} Minuten

source: Activity Summary {}
de: Zusammenfassung der Aktivitäten am {}

source: Your Schedule for Today
de: Ihr Tagesplan für Heute

source: Activity Finished
de: Aktivität Beendet

source: The activity "{title}" just finished and you are in charge of it. Please review.
de: Die Aktivität "{title}" wurde gerade beendet und Sie sind die für diese Aktivität verantwortlich. Bitte tragen Sie ein Ergebnis ein.

source: This is a reminder for an upcoming
de: Dies ist eine Erinnerung für ein/e/n bevorstehende/n/s

source: Dear
de: Liebe/r

source: Attached you will find the requested Excel activity report for
de: Im Anhang finden Sie den angeforderten Excel-Aktivitätsbericht für

source: You have
de: Sie haben

source: Activities today
de: Aktivitäten heute

source: There were %(activities_count)s activities on %(report_date)s.
de: Es gab %(activities_count)s Aktivitäten am %(report_date)s.

source: Is Default
de: Ist Standardwert

source: There are more participants currently participating in this activity than the maximum capacity of the selected conference room allows.
de: Es nehmen momentan mehr Personen an dieser Aktivität teil als die maximale Kapazität des ausgewählten Konferenzraumes erlaubt.

source: <b>User Activity</b>
de: <b>Nutzeraktivität</b>

source: <p> Are you sure you want to delete all the future instances of this activity? <br> Only 'Planned' and 'Canceled' activities will be deleted. <br> Depending on the number of activities to be deleted <br> it may take some time until the deleted activities are no longer displayed in the activity list. </p>
de: <p> Sind Sie sich sicher, dass Sie alle zukünftigen Instanzen dieser Aktivität löschen wollen? <br> Nur geplante und abgesagte Aktivitäten werden gelöscht. <br> Abhängig von der Anzahl an Aktivitäten, die gelöscht werden sollen, <br> kann dies eine Weile dauern bis sie nicht mehr in der Aktivitätenliste angezeigt werden. </p>

source: Delete Next Occurrences
de: Folgeaktivitäten Löschen

source: Delete
de: Löschen

source: Next Activity
de: Nächste Aktivität

source: Previous Activity
de: Vorherige Aktivität

source: Show Participants' Activities
de: Zeige Aktivitäten der Teilnehmer*innen

source: Color
de: Farbe

source: Multiplier
de: Multiplikator

source: Main Information
de: Hauptinformationen

source: Additional Information
de: Zusätzliche Informationen

source: Participant Information
de: Informationen zu den Teilnehmer*innen

source: Repeat Until
de: Wiederholen Bis

# As a table header
source: Created
de: Erstellt am

# As a table header
source: Review
de: Ergebnis

source: Status Changed
de: Status Geändert

source: Primary Phone Number
de: Primäre Telefonnummer

source: Is Available
de: Ist Verfügbar

source: Is Occupied
de: Ist Beschäftigt
