Repository: pypi-data/pypi-mirror-348
Catalog: packages/TeddyCloudStarter/teddycloudstarter-0.6.3-py3-none-any.whl/TeddyCloudStarter/locales/*/LC_MESSAGES/teddycloudstarter.po
Languages: de

source: Select language / Sprache wählen:
de: Sprache wählen / Select language:

source: What would you like to do?
de: Was möchten Sie tun?

source: Modify configuration
de: Konfiguration ändern

source: Backup configuration
de: Konfiguration sichern

source: Delete configuration and start over
de: Konfiguration löschen und neu beginnen

source: Restart Docker services
de: Docker-Dienste neustarten

source: Exit
de: Beenden

source: Configuration saved to {}
de: Konfiguration gespeichert in {}

source: Backup created at {}
de: Sicherung erstellt in {}

source: Configuration file {} deleted
de: Konfigurationsdatei {} gelöscht

source: Docker is not available.
de: Docker ist nicht verfügbar.

source: Restarting Docker services...
de: Docker-Dienste werden neugestartet...

source: Services restarted successfully.
de: Dienste wurden erfolgreich neugestartet.

source: Error restarting services: {}
de: Fehler beim Neustarten der Dienste: {}

source: Are you sure you want to delete the configuration and start over?
de: Sind Sie sicher, dass Sie die Konfiguration löschen und neu beginnen möchten?

source: How would you like to deploy TeddyCloud?
de: Wie möchten Sie TeddyCloud bereitstellen?

source: Direct (For internal networks)
de: Direkt (Für interne Netzwerke)

source: With Nginx (For internet-facing deployments)
de: Mit Nginx (Für Internet-zugewandte Bereitstellungen)

source: Would you like to expose the TeddyCloud Admin Web Interface on HTTP (port 80)?
de: Möchten Sie die TeddyCloud Admin Weboberfläche über HTTP (Port 80) zugänglich machen?

source: Warning: Port 80 appears to be in use.
de: Warnung: Port 80 scheint bereits verwendet zu werden.

source: Would you like to specify a different port?
de: Möchten Sie einen anderen Port angeben?

source: Enter HTTP port:
de: HTTP-Port eingeben:

source: Would you like to expose the TeddyCloud Admin Web Interface on HTTPS (port 8443)?
de: Möchten Sie die TeddyCloud Admin Weboberfläche über HTTPS (Port 8443) zugänglich machen?

source: Warning: Port 8443 appears to be in use.
de: Warnung: Port 8443 scheint bereits verwendet zu werden.

source: Warning: Port 443 appears to be in use.
de: Warnung: Port 443 scheint bereits verwendet zu werden.

source: Would you like to specify a different port for TeddyCloud backend (normally 443)?
de: Möchten Sie einen anderen Port für das TeddyCloud-Backend angeben (normalerweise 443)?

source: Enter TeddyCloud backend port:
de: TeddyCloud-Backend-Port eingeben:

source: Warning: You have not exposed any ports for the admin interface.
de: Warnung: Sie haben keine Ports für die Administrationsoberfläche freigegeben.

source: Are you sure you want to continue without access to the admin interface?
de: Sind Sie sicher, dass Sie ohne Zugriff auf die Administrationsoberfläche fortfahren möchten?

source: Warning: Port 80 appears to be in use. This is required for Nginx.
de: Warnung: Port 80 scheint bereits verwendet zu werden. Dieser wird für Nginx benötigt.

source: Warning: Port 443 appears to be in use. This is required for Nginx.
de: Warnung: Port 443 scheint bereits verwendet zu werden. Dieser wird für Nginx benötigt.

source: Do you want to continue anyway?
de: Möchten Sie trotzdem fortfahren?

source: Enter the domain name for your TeddyCloud instance:
de: Geben Sie den Domainnamen für Ihre TeddyCloud-Instanz ein:

source: How would you like to handle HTTPS?
de: Wie möchten Sie HTTPS handhaben?

source: Let's Encrypt (automatic certificates)
de: Let's Encrypt (automatische Zertifikate)

source: Custom certificates (provide your own)
de: Eigene Zertifikate (selbst bereitstellen)

source: Let's Encrypt Requirements
de: Let's Encrypt Anforderungen

source: To use Let's Encrypt, you need:
de: Um Let's Encrypt zu verwenden, benötigen Sie:

source: 1. A public domain name pointing to this server
de: 1. Einen öffentlichen Domainnamen, der auf diesen Server zeigt

source: 2. Public internet access on ports 80 and 443
de: 2. Öffentlichen Internetzugriff auf die Ports 80 und 443

source: 3. This server must be reachable from the internet
de: 3. Dieser Server muss vom Internet aus erreichbar sein

source: Do you meet these requirements?
de: Erfüllen Sie diese Anforderungen?

source: Would you like to test if Let's Encrypt can issue a certificate for your domain?
de: Möchten Sie testen, ob Let's Encrypt ein Zertifikat für Ihre Domain ausstellen kann?

source: Requesting Let's Encrypt certificate in staging mode...
de: Let's Encrypt-Zertifikat wird im Staging-Modus angefordert...

source: Certificate request test was successful!
de: Zertifikatsanforderungstest war erfolgreich!

source: Certificate request failed: {}
de: Zertifikatsanforderung fehlgeschlagen: {}

source: Error requesting certificate: {}
de: Fehler bei der Anforderung des Zertifikats: {}

source: Switching to custom certificates mode...
de: Wechsel zum Modus für eigene Zertifikate...

source: Custom Certificate Instructions
de: Anleitung für eigene Zertifikate

source: You will need to provide your own SSL certificates.
de: Sie müssen Ihre eigenen SSL-Zertifikate bereitstellen.

source: 1. Create a directory: ./certs
de: 1. Erstellen Sie ein Verzeichnis: ./certs

source: 2. Place your certificate as: ./certs/server.crt
de: 2. Platzieren Sie Ihr Zertifikat als: ./certs/server.crt

source: 3. Place your private key as: ./certs/server.key
de: 3. Platzieren Sie Ihren privaten Schlüssel als: ./certs/server.key

source: Certificates not found.
de: Zertifikate nicht gefunden.

source: I'll provide the certificates later
de: Ich stelle die Zertifikate später bereit

source: Check again for certificates
de: Erneut nach Zertifikaten suchen

source: Switch to Let's Encrypt
de: Zu Let's Encrypt wechseln

source: Certificates found!
de: Zertifikate gefunden!

source: How would you like to secure your TeddyCloud instance?
de: Wie möchten Sie Ihre TeddyCloud-Instanz absichern?

source: No additional security
de: Keine zusätzliche Sicherheit

source: Basic Authentication (.htpasswd)
de: Basis-Authentifizierung (.htpasswd)

source: Client Certificates
de: Client-Zertifikate

source: Basic Authentication Instructions
de: Anleitung zur Basis-Authentifizierung

source: You will need to create an .htpasswd file:
de: Sie müssen eine .htpasswd-Datei erstellen:

source: 1. Create a directory: ./data
de: 1. Erstellen Sie ein Verzeichnis: ./data

source: 2. Create the file: ./data/htpasswd
de: 2. Erstellen Sie die Datei: ./data/htpasswd

source: You can generate this file using htpasswd utility or online generators.
de: Sie können diese Datei mit dem htpasswd-Dienstprogramm oder Online-Generatoren erstellen.

source: How would you like to handle client certificates?
de: Wie möchten Sie Client-Zertifikate handhaben?

source: I'll provide my own certificates
de: Ich stelle meine eigenen Zertifikate bereit

source: Generate certificates for me
de: Zertifikate für mich generieren

source: Client Certificate Instructions
de: Anleitung für Client-Zertifikate

source: You will need to provide your own client certificates:
de: Sie müssen Ihre eigenen Client-Zertifikate bereitstellen:

source: 1. Place your CA certificate as: ./data/client_certs/ca.crt
de: 1. Platzieren Sie Ihr CA-Zertifikat als: ./data/client_certs/ca.crt

source: 2. Place your server certificate as: ./data/client_certs/server.crt
de: 2. Platzieren Sie Ihr Server-Zertifikat als: ./data/client_certs/server.crt

source: 3. Place your server key as: ./data/client_certs/server.key
de: 3. Platzieren Sie Ihren Server-Schlüssel als: ./data/client_certs/server.key

source: Client certificates not found.
de: Client-Zertifikate nicht gefunden.

source: Would you like to restrict access by IP address?
de: Möchten Sie den Zugriff durch IP-Adresse einschränken?

source: Enter the IP addresses to allow (empty line to finish):
de: Geben Sie die zulässigen IP-Adressen ein (leere Zeile zum Beenden):

source: You can use individual IPs (e.g., 192.168.1.10) or CIDR notation (e.g., 192.168.1.0/24)
de: Sie können einzelne IPs (z.B. 192.168.1.10) oder CIDR-Notation (z.B. 192.168.1.0/24) verwenden

source: IP address or CIDR
de: IP-Adresse oder CIDR

source: Added: {}
de: Hinzugefügt: {}

source: Invalid IP address or CIDR: {}
de: Ungültige IP-Adresse oder CIDR: {}

source: Generating client certificates...
de: Client-Zertifikate werden generiert...

source: Client certificates generated successfully!
de: Client-Zertifikate wurden erfolgreich generiert!

source: The following files have been created:
de: Die folgenden Dateien wurden erstellt:

source: - {}/ca.crt: The CA certificate
de: - {}/ca.crt: Das CA-Zertifikat

source: - {}/server.crt and server.key: Server certificates
de: - {}/server.crt und server.key: Server-Zertifikate

source: - {}/client.crt and client.key: Client certificates
de: - {}/client.crt und client.key: Client-Zertifikate

source: - {}/client.p12: Client certificate bundle (password: teddycloud)
de: - {}/client.p12: Client-Zertifikatspaket (Passwort: teddycloud)

source: Install the client.p12 file on devices that need to access TeddyCloud.
de: Installieren Sie die client.p12-Datei auf Geräten, die auf TeddyCloud zugreifen müssen.

source: Error generating certificates: {}
de: Fehler beim Generieren der Zertifikate: {}

source: OpenSSL is not available on your system.
de: OpenSSL ist auf Ihrem System nicht verfügbar.

source: Setup complete!
de: Setup abgeschlossen!

source: Would you like to start the Docker services now?
de: Möchten Sie die Docker-Dienste jetzt starten?

source: Configuration complete!
de: Konfiguration abgeschlossen!

source: Current Configuration
de: Aktuelle Konfiguration

source: Setting
de: Einstellung

source: Value
de: Wert

source: Mode
de: Modus

source: HTTPS Mode
de: HTTPS-Modus

source: Security Type
de: Sicherheitstyp

source: Allowed IPs
de: Erlaubte IPs

source: Docker Compose configuration generated successfully.
de: Docker Compose-Konfiguration erfolgreich generiert.

source: Error generating Docker Compose file: {}
de: Fehler beim Generieren der Docker Compose-Datei: {}

source: Nginx configurations generated successfully.
de: Nginx-Konfigurationen erfolgreich generiert.

source: Error generating Nginx configurations: {}
de: Fehler beim Generieren der Nginx-Konfigurationen: {}

source: .env file generated successfully.
de: .env-Datei erfolgreich generiert.

source: Error generating .env file: {}
de: Fehler beim Generieren der .env-Datei: {}

source: How would you like to handle the .htpasswd file?
de: Wie möchten Sie die .htpasswd-Datei handhaben?

source: I'll provide my own .htpasswd file
de: Ich stelle meine eigene .htpasswd-Datei bereit

source: Generate .htpasswd file with the wizard
de: .htpasswd-Datei mit dem Assistenten erstellen

source: You need to place your .htpasswd file at:
de: Sie müssen Ihre .htpasswd-Datei platzieren unter:

source: .htpasswd file not found.
de: .htpasswd-Datei nicht gefunden.

source: I'll provide the .htpasswd file later
de: Ich stelle die .htpasswd-Datei später bereit

source: Check again for .htpasswd file
de: Erneut nach .htpasswd-Datei suchen

source: Switch to generating the .htpasswd file with the wizard
de: Zur Erstellung der .htpasswd-Datei mit dem Assistenten wechseln

source: .htpasswd file found!
de: .htpasswd-Datei gefunden!

source: Let's create a .htpasswd file with your users and passwords.
de: Lassen Sie uns eine .htpasswd-Datei mit Ihren Benutzern und Passwörtern erstellen.

source: Enter username (leave empty to finish adding users):
de: Benutzernamen eingeben (leer lassen, um die Benutzereingabe abzuschließen):

source: Enter password:
de: Passwort eingeben:

source: User '{}' added.
de: Benutzer '{}' hinzugefügt.

source: No password entered, user not added.
de: Kein Passwort eingegeben, Benutzer nicht hinzugefügt.

source: Generating .htpasswd file...
de: .htpasswd-Datei wird generiert...

source: Docker is not available. Cannot generate .htpasswd file.
de: Docker ist nicht verfügbar. Die .htpasswd-Datei kann nicht erstellt werden.

source: You'll need to create the .htpasswd file manually.
de: Sie müssen die .htpasswd-Datei manuell erstellen.

source: .htpasswd file generated successfully!
de: .htpasswd-Datei erfolgreich generiert!

source: Error generating .htpasswd file: {}
de: Fehler beim Generieren der .htpasswd-Datei: {}

source: No users added. You'll need to create the .htpasswd file manually.
de: Keine Benutzer hinzugefügt. Sie müssen die .htpasswd-Datei manuell erstellen.

source: Basic Authentication Setup Complete
de: Basis-Authentifizierung-Setup abgeschlossen

source: Your .htpasswd file is located at ./data/htpasswd
de: Ihre .htpasswd-Datei befindet sich unter ./data/htpasswd

source: Nginx will be configured to use this file for authentication.
de: Nginx wird so konfiguriert, dass diese Datei für die Authentifizierung verwendet wird.

source: Basic Authentication Note
de: Hinweis zur Basis-Authentifizierung

source: Don't forget to create your .htpasswd file at ./data/htpasswd
de: Vergessen Sie nicht, Ihre .htpasswd-Datei unter ./data/htpasswd zu erstellen

source: before starting the services.
de: bevor Sie die Dienste starten.

source: ... additional error lines omitted ...
de: ... weitere Fehlerzeilen ausgelassen ...

source: After installing OpenSSL, restart the wizard or choose a different option.
de: Nach der Installation von OpenSSL, starten Sie den Assistenten neu oder wählen Sie eine andere Option.

source: All services stopped successfully.
de: Alle Dienste wurden erfolgreich gestoppt.

source: Backup created at {path}
de: Sicherung erstellt unter {path}

source: CA certificate has been created in the ca subfolder.
de: CA-Zertifikat wurde im ca-Unterordner erstellt.

source: CA certificate or key not found. Cannot revoke certificate.
de: CA-Zertifikat oder -Schlüssel nicht gefunden. Zertifikat kann nicht widerrufen werden.

source: Certificate refresh was successful!
de: Zertifikatsaktualisierung war erfolgreich!

source: Certificate request was successful!
de: Zertifikatsanfrage war erfolgreich!

source: Client certificate
de: Client-Zertifikat

source: Client certificate bundle (password: teddycloud)
de: Client-Zertifikatspaket (Passwort: teddycloud)

source: Client certificate generated successfully!
de: Client-Zertifikat erfolgreich generiert!

source: Configuration file {path} deleted
de: Konfigurationsdatei {path} gelöscht

source: Controls:
de: Steuerung:

source: Download and install from https://slproweb.com/products/Win32OpenSSL.html
de: Herunterladen und installieren von https://slproweb.com/products/Win32OpenSSL.html

source: Error details:
de: Fehlerdetails:

source: Failed to start logs process.
de: Starten des Log-Prozesses fehlgeschlagen.

source: Force refreshing Let's Encrypt certificates...
de: Erzwinge Aktualisierung der Let's Encrypt Zertifikate...

source: Install the .p12 file on devices that need to access TeddyCloud.
de: Installieren Sie die .p12-Datei auf Geräten, die auf TeddyCloud zugreifen müssen.

source: Installation instructions:
de: Installationsanleitung:

source: Let's create a .htpasswd file with your users and passwords.
de: Lassen Sie uns eine .htpasswd-Datei mit Ihren Benutzern und Passwörtern erstellen.

source: Live Logs
de: Live Protokolle

source: Live Logs - Service:
de: Live Protokolle - Dienst:

source: Log display paused
de: Protokollanzeige pausiert

source: Log display resumed
de: Protokollanzeige fortgesetzt

source: Log view closed.
de: Protokollansicht geschlossen.

source: Logs cleared
de: Protokolle gelöscht

source: No client certificates directory found.
de: Kein Verzeichnis für Client-Zertifikate gefunden.

source: No client certificates found to revoke.
de: Keine Client-Zertifikate zum Widerrufen gefunden.

source: Paused
de: Pausiert

source: Playing
de: Wiedergabe

source: Please use an online .htpasswd generator or the htpasswd utility.
de: Bitte verwenden Sie einen Online-.htpasswd-Generator oder das htpasswd-Dienstprogramm.

source: Press Enter to return to menu...
de: Drücken Sie Enter, um zum Menü zurückzukehren...

source: Remember to place your .htpasswd file at ./data/.htpasswd
de: Denken Sie daran, Ihre .htpasswd-Datei unter ./data/.htpasswd zu platzieren

source: Revoking client certificate...
de: Client-Zertifikat wird widerrufen...

source: Run 'sudo apt install openssl'
de: Führen Sie 'sudo apt install openssl' aus

source: Run 'sudo dnf install openssl'
de: Führen Sie 'sudo dnf install openssl' aus

source: Running
de: Läuft

source: Server certificate has been created in the server subfolder.
de: Server-Zertifikat wurde im Server-Unterordner erstellt.

source: Services started successfully.
de: Dienste wurden erfolgreich gestartet.

source: Starting Docker services...
de: Docker-Dienste werden gestartet...

source: Stopped
de: Gestoppt

source: Stopping all Docker services...
de: Alle Docker-Dienste werden gestoppt...

source: The client certificate
de: Das Client-Zertifikat

source: The client private key
de: Der private Client-Schlüssel

source: Unknown
de: Unbekannt

source: Use Homebrew: 'brew install openssl'
de: Verwenden Sie Homebrew: 'brew install openssl'

source: You'll need to create the .htpasswd file manually at ./data/.htpasswd
de: Sie müssen die .htpasswd-Datei manuell unter ./data/.htpasswd erstellen

source: ause
de: ausieren

source: esume
de: ortsetzen

source: has been created in the clients subfolder:
de: wurde im Clients-Unterordner erstellt:

source: lear
de: öschen

source: uit
de: eenden
