РАЗДЕЛИТЕЛЬ_ПАР = "БОссийн__--__разделитель пар/%/%/%"
РАЗДЕЛИТЕЛЬ_ЗНАЧЕНИЙ = "БОссийн__--__разделитель значений/%/%/%"
def записать_в_файл(текст: str, путь: str):
    try:
        with open(путь, mode="w", encoding="utf-8") as файл:
            файл.write(текст)
    except Exception as ошибка:
        print(ошибка)
        return False
    return True

def  считать_из_файла(путь: str):
    try:
        with open(путь, mode="r", encoding="utf-8") as файл:
           return файл.read()
    except Exception as ошибка:
        print(ошибка)
        return False
    return True

def словарь_в_текст(словарь: dict):
    результат = ""
    for пара in словарь.items():
        ключ, значение = пара
        текстовая_пара = f"{ключ}{РАЗДЕЛИТЕЛЬ_ЗНАЧЕНИЙ}{значение}"
        результат += текстовая_пара + РАЗДЕЛИТЕЛЬ_ПАР
    return результат[:-len(РАЗДЕЛИТЕЛЬ_ПАР)]

def текст_в_словарь(текст: str):
    результат = {}
    пары = текст.split(РАЗДЕЛИТЕЛЬ_ПАР)
    for пара in пары:
        ключ, значение = пара.split(РАЗДЕЛИТЕЛЬ_ЗНАЧЕНИЙ, 1)
        результат[ключ] = значение
    return результат

def все_словари_в_текст(список_словарей: list):
    текст = ""
    for словарь in список_словарей:
        текст += словарь_в_текст(словарь) + "\n"
    return текст

def весь_текст_в_словари(текст: str):
    список = []
    for строка in текст.splitlines():
        словарь = текст_в_словарь(строка)
        список.append(словарь)
    return список

if __name__ == "__main__":
    # путь_к_файлу = r"C:\Users\Зеленков Тимофей\Documents\Python\Програмирование\файл из питона.txt"
    список_словарей = [
        {"ключ1": "значение1", "ключ2": "значение2"},
        {"ключ3": "значение3", "ключ4": "значение4"}
    ]

    текст = все_словари_в_текст(список_словарей)
    обратно = весь_текст_в_словари(текст)
    print(список_словарей == обратно)
    print(текст)

# этот_файл = __file__
# import os
# эта_папка = os.path.dirname(этот_файл)
# файл_с_текстом = os.path.join(эта_папка, "Здесь хранится текст.txt")
# print(считать_из_файла(файл_с_текстом))

# print()