from random import randint
def цветная_печать(текст,  стиль="", рандомный=False, красный=False, зелёный=False, синий=False, коричневый=False, фиолетовый=False, не_печатать=False):
    def определить_стиль(стиль: str):
        стиль = стиль.lower()
        результат = ""
        if "ж" in стиль:
            результат += ";1"
        if "к" in стиль:
            результат += ";3"
        if "п" in стиль:
            результат += ";4"
        if "з" in стиль:
            результат += ";9"
        return результат
    
    итоговый_стиль = определить_стиль(стиль)
    if красный:
        цвет = "255;0;0"
    elif зелёный:
        цвет = "0;255;0"
    elif синий:
        цвет = "0;0;255"
    elif коричневый:
        цвет = "102;51;0"
    elif фиолетовый:
        цвет = "102;0;102"
    elif рандомный:
        результат = ""
        for буква in текст:
            К = randint(0, 255)
            З = randint(0, 255)
            С = randint(0, 255)
            результат += f"\x1B[38;2;{К};{З};{С}m{буква}"
            
        результат += "\x1B[0m"
        print(результат)
        return
    else:
        цвет = "255;255;255"
    результат = f"\x1B[38;2;{цвет}{итоговый_стиль}m{текст}\x1B[0m"
    if не_печатать:
            return результат
    print(результат)
    # \x1B - особый символ, который включает режим другого цвета
    # 38;2; - говорит о том, что следующие 3 команды будут в формате RGB
    # После цвета ;1 - ососбый стиль (в данном случае жирный)
    # \x1B[0m - все, что будет написано после этого символа будет стандартным цветом. Если не будет этой строчки, все последующие print будут печататься тем же цветом 

if __name__ == "__main__":
    коричневый = цветная_печать("Shit Happens", коричневый=True, не_печатать=True)
    зелёный = цветная_печать("БАЛДЁЖ", зелёный=True, не_печатать=True)
    print(f"Это полный {коричневый}, а не ваш этот {зелёный}")