Repository: pypi-data/pypi-mirror-348
Catalog: packages/wbcore/wbcore-1.50.15-py2.py3-none-any.whl/wbcore/contrib/directory/locale/*/LC_MESSAGES/django.po
Languages: de

source: Main information
de: Hauptinformationen

source: Additional Fields
de: Zusatzfelder

source: System-Files
de: Systemdateien

source: Work Fields
de: Arbeitsfelder

source: Misc.
de: Sonstige

source: Activity Heat
de: Aktivitätsscore

source: The tier of the company with 1 being the top tier and 5 being the lowest tier.
de: Der Rang des Unternehmens mit 1 als bestem und 5 als schlechtestem Rang.

source: Main Workbench Company
de: Hauptunternehmen der Workbench

source: The main company of the Workbench. All employees of this company are considered to have "employee" status and have more permissions than other users.
de: Die Hauptunternehmen der Workbench. Alle Angestellt*innen dieses Unternehmens gelten als "Mitarbeiter*innen" und haben mehr Rechte als andere Nutzer*innen.

source: Please select a valid company.
de: Bitte wählen Sie ein valides Unternehmen aus.

source: Main Country Code
de: Primärer Ländercode

source: Determines the country code currently used exclusively for parsing of phone numbers. Should be the country where the phone number is being dialled from.
de: Legt die Ländervorwahlfest. Es sollte sich um das Land handeln, von dem aus gewählt wird.

source: Only exact alpha_2 country codes (e.g. DE, CH) allowed.
de: Nur exakte Alpha_2-Ländercodes (z.B. DE, CH) zulässig.

source: Company Contact
de: Unternehmenskontakt

source: Locations
de: Standorte

source: City
de: Stadt

source: Country
de: Land

source: State
de: Bundesland/Staat

source: Continent
de: Kontinent

source: Types
de: Typen

source: Currencies
de: Währungen

source: Edited
de: Zuletzt Bearbeitet

source: Entries
de: Einträge

source: Social Media Platform
de: Social Media Plattform

source: Tiers
de: Ränge

source: Address
de: Adresse

source: Positions
de: Positionen

source: Customer Statuses
de: Kundenstatus

source: Telephone
de: Telefon

source: Companies' Employee
de: Angestellte*r

source: Names
de: Namen

source: Company is Primary Employer
de: Unternehmen ist Hauptarbeitgeber

source: Primary Email
de: Primäre E-Mail

source: Is Primary Employer
de: Ist Hauptarbeitgeber*in

source: Company Types
de: Unternehmenstypen

source: No Relationship Manager
de: Kein*e Betreuer*in

source: Relationship Types
de: Beziehungstypen

source: Relationship To
de: Beziehung Zu

source: Relationship From
de: Beziehung Von

source: Counter Relationship Types
de: Typen der Gegenbeziehung

source: Clients
de: Klient*innen

source: Future Relationship Managers
de: Zukünftige Betreuer*innen

source: Work
de: Geschäftlich

source: Private
de: Privat

# Indicates the contact location
source: Home
de: Zuhause

source: Other
de: Sonstiges

source: Fix
de: Festnetz

source: Cell
de: Mobiltelefon

source: Draft
de: Entwurf

source: Pending
de: Ausstehend

source: Approved
de: Genehmigt

source: Submit
de: Einreichen

source: Are you sure you want to submit this banking contact for review?
de: Sind Sie sicher, dass Sie diese Bankdaten zur Überprüfung einreichen wollen?

source: <p>A banking contact is in need of approving.</p>
de: <p>Neue Bankdaten müssen genehmigt werden.</p>

source: New pending banking contact
de: Neuer ausstehender Bankkontakt

source: Approve
de: Genehmigen

source: Are you sure you want to approve this banking contact?
de: Sind Sie sicher, dass Sie diese Bankdaten genehmigen wollen?

source: Deny
de: Ablehnen

source: Are you sure you want to deny this banking contact?
de: Sind Sie sicher, dass Sie diese Bankdaten ablehnen wollen?

source: Edit
de: Bearbeiten

source: Are you sure you want to edit this banking contact?
de: Sind Sie sicher, dass Sie diese Bankdaten bearbeiten möchten?

# Primary flag for banking contact
source: Primary
de: Primäre Bankdaten

source: Location
de: Standort

# Banking Entry
source: Entry
de: Eintrag

source: Institute
de: Institut

source: Institute (Additional)
de: Institut (zusätzliche Informationen)

source: Currency
de: Währung

source: Additional Information
de: Zusätzliche Informationen

source: Can be used in place of IBAN to communicate banking information
de: Kann anstelle der IBAN zur Übermittlung von Bankinformationen verwendet werden

source: Banking Contact
de: Bankkontakt

source: Banking Contacts
de: Bankkontakte

# Primary flag for address contact
source: Primary
de: Primäre Adresse

source: Entry
de: Eintrag

source: Street
de: Straße

source: Street (Additional)
de: Straße (zusätzliche Informationen)

source: ZIP
de: ZIP/PLZ

source: Province
de: Region/Bundesland

source: Address Contact
de: Adresskontakt

source: Address Contacts
de: Adresskontakte

# Primary flag for telephone contact
source: Primary
de: Primärer Telefonkontakt

source: Number
de: Nummer

source: Type
de: Typ

source: Telephone Contact
de: Telefonische Kontakte

source: Telephone Contacts
de: Telefonische Kontakte

# Primary flag for email contact
source: Primary
de: Primäre E-Mail-Adresse

source: Email Address
de: E-Mail-Adresse

source: E-Mail Contact
de: E-Mail Kontakt

source: E-Mail Contacts
de: E-Mail Kontakte

# Primary flag for website contact
source: Primary
de: Primäre Webseite

source: Website Contact
de: Webseiten-Kontakt

source: Website Contacts
de: Webseiten-Kontakte

# Primary flag for social media contact
source: Primary
de: Primär

source: Platform
de: Plattform

source: The social media platform for this contact
de: Die Social Media Plattform dieses Kontaktes

source: Social Media Contact
de: Social-Media-Kontakt

source: Social Media Contacts
de: Social-Media-Kontakte

source: Title
de: Titel

source: Customer Status
de: Kundenstatus

source: Company Type
de: Unternehmenstyp

source: Specialization
de: Spezialisierung

source: Specializations
de: Spezialisierungen

source: Company
de: Unternehmen

source: Relationship Managers
de: Betreuer*innen

source: People in charge of this entry
de: Zuständige Personen für diesen Eintrag

source: Last Event
de: Letztes Event

source: The last event of this entry. Can be ordered by end date.
de: Das letzte Event dieses Eintrags. Kann nach Enddatum sortiert werden.

source: The Entry's Relationships
de: Die Beziehungen dieses Eintrags

source: Entry {id}
de: Eintrag {id}

source: Mr.
de: Hr.

source: Mrs.
de: Fr.

source: Prefix
de: Präfix

source: First Name
de: Vorname

source: Last Name
de: Nachname

source: Initials
de: Initialien

source: Employers
de: Arbeitgeber*innen

source: The person's employers
de: Die Arbeitgeber*innen der Person

source: Available Employee
de: Verfügbare*r Angestellte*r

source: Birthday
de: Geburtstag

source: Persons
de: Personen

source: Number of employees
de: Anzahl an Angestellten*Angestelltinnen

source: Tier
de: Rang

source: Description
de: Beschreibung

source: Companies
de: Unternehmen

source: Removed {main_company} from {profile}'s employers
de: {main_company} von {profile}s Arbeitgeber*innen entfernt

source: Assigned {clients} manager role(s) to {substitute_profile}
de: {clients} Betreuerfunktionen {substitute_profile} zugewiesen

source: Relationship Type
de: Beziehungstyp

source: Counter Relationship
de: Gegenbeziehung

source: Relationship
de: Beziehung

source: Relationships
de: Beziehungen

source: Pending Add
de: Ausstehendes Hinzufügen

source: Pending Remove
de: Ausstehendes Entfernen

source: Removed
de: Entfernt

source: Relationship Manager
de: Betreuer*in

source: Primary
de: Primär

source: Client
de: Kund*in

source: Created
de: Erstellt Am

source: Submitting
de: Einreichen

source: Are you sure you want to submit your draft for review?
de: Sind Sie sicher, dass Sie Ihren Entwurf zur Überprüfung einreichen wollen?

source: Are you sure you want to approve this relationship?
de: Sind Sie sicher, dass Sie diese Beziehung genehmigen wollen?

source: Denial
de: Ablehnung

source: Are you sure you want to deny this relationship?
de: Sind Sie sich sicher, dass Sie diese Beziehung ablehnen wollen?

source: Approval
de: Genehmigung

source: Are you sure you want to deny removal of this relationship?
de: Sind Sie sich sicher, dass Sie die Löschung dieser Beziehung ablehnen wollen?

source: Are you sure you want to remove this relationship?
de: Sind Sie sich sicher, dass Sie diese Beziehung entfernen wollen?

source: Make Primary
de: Primär Machen

source: Are you sure you want to request making this relationship manager primary?
de: Sind Sie sich sicher, dass Sie diese*n Betreuer*in zur*m Hauptbetreuer*in machen möchten?

source: Remove
de: Entfernen

source: Removal
de: Entfernen

source: Are you sure you want to request removal of this relationship?
de: Sind Sie sich sicher, dass Sie eine Löschung dieser Beziehung beantragen wollen?

source: Reinstate
de: Wiedereinsetzen

source: Are you sure you want to request reinstating this relationship?
de: Sind Sie sicher, dass Sie die Wiederaufnahme dieser Beziehung beantragen wollen?

source: {client} is client of {manager}
de: {client} ist ein*e Kunde*in von {manager}

source: Client Manager Relationship
de: Kund*innen-Betreuer*innen-Beziehung

source: Client Manager Relationships
de: Kunden-Betreuer-Beziehungen

source: New Client Manager Relationship for {client}
de: Neue*r Kundenbetreuer*in für {client}

source: User requested that {manager} is the relationship manager of {client}.
de: Der*Die Benutzer*in hat beantragt, dass {manager} der*die Betreuer*in von {client} wird.

source: Removal of Client Manager Relationship for {client}
de: Aufhebung des Betreuungsverhältnisses für {client}

source: User requested that relationship manager {manager} of {client} should be removed.
de: Der*Die Benutzer*in hat beantragt, dass {manager} als Betreuer*in von {client} entfernt wird.

source: Employee
de: Angestellte*r

source: Employer
de: Arbeitgeber*in

source: Employer Employee Relationship
de: Arbeitsverhältnis

source: Primary Address
de: Primäre Adresse

source: Primary Telephone
de: Primäre Telefonnummer

# Warning for wrong email
source: E-Mail address already in use for this {type}.
de: Diese E-Mail wird für diesen {type} schon verwendet.

source: Invalid e-mail address
de: Ungültige E-Mail-Adresse

source: Website already in use for this {type}.
de: Diese Webseite wird für diesen {type} schon verwendet.

source: Address already in use for this {type}.
de: Diese Adresse wird für diesen {type} schon verwendet.

# Phonenumber
source: Number
de: Telefonnummer

source: Phone number already in use for this {type}.
de: Diese Telefonnummer wird für diesen {type} schon verwendet.

source: Invalid phone number format
de: Ungültiges Telefonnummernformat

source: Phone number already in use for this {entry}.
de: Diese Telefonnummer wird für {entry} bereits verwendet.

source: IBAN already in use for this {type}.
de: Diese IBAN wird für diese/s {type} schon verwendet.

source: The URL you provided seems to be wrong.
de: Die URL, die Sie angegeben haben, scheint falsch zu sein.

source: This social media account is already in use for this user
de: Dieser Social-Media-Account wird bereits von diesem*r Benutzer*in verwendet

source: Cannot add a duplicate company type.
de: Dieser Unternehmenstyp existiert bereits.

source: Cannot add a duplicate specialization.
de: Diese Spezialisierung existiert bereits.

source: Cannot add a duplicate customer status.
de: Dieser Kundenstatus existiert bereits.

source: This field indicates a person's primary employer's status. It is automatically filled when the status of the primary employer is set.
de: Dieses Feld gibt den Unternehmensstatus des Hauptunternehmens einer Person an. Es wird automatisch gesetzt wenn der Status des*der Arbeitgebers*Arbeitgeberin gesetzt wird.

source: This field indicates a person's position with their primary employer. It is automatically filled when this person is assigned an employer and this person's position with that employer is filled in.
de: Dieses Feld gibt die Position einer Person in ihrem Hauptunternehmen an. Es wird automatisch ausgefüllt wenn eine Person eine*n Arbeitgeber*in zugewiesen bekommt und für diese*n Arbeitgeber*in eine Position gesetzt wird.

source: Position In Company
de: Position im Unternehmen

source: Primary Manager
de: Primäre*r Betreuer*in

source: Profile Image
de: Profilbild

source: Primary Employer
de: Hauptarbeitgeber*in

source: User Account
de: Benutzer*innenkonto

source: Last Connection
de: Letzte Verbindung

source: Secondary Email
de: Sekundäre E-Mail

source: Personality Profile Red
de: Persönlichkeitsprofil Rot

source: Personality Profile Green
de: Persönlichkeitsprofil Grün

source: Personality Profile Blue
de: Persönlichkeitsprofil Blau

source: Tier of the primary employer
de: Rang des*der Hauptarbeitgebers*in

source: You need to select an employer, if you have a position selected.
de: Sie müssen eine*n Arbeitgeber*in angeben, wenn Sie eine Position ausgewählt haben.

source: Cannot add a duplicate position.
de: Diese Position existiert bereits.

source: Cannot add duplicate relationship type.
de: Dieser Beziehungtyp existiert bereits.

source: From entry has to be set.
de: Der "Von"-Eintrag muss gesetzt werden.

source: {employee} is already an employee of {employer}.
de: {employee} ist bereits bei {employer} angestellt.

source: Cannot degrade primary employer. Add a new primary employer instead.
de: Hauptarbeitgeber*innen können nicht entfernt werden. Setzen Sie stattdessen eine*n neuen Hauptarbeitgeber*in.

source: You need to select a client
de: Sie müssen eine*n Klient*in auswählen

source: You need to select a manager
de: Sie müssen eine*n Betreuer*in auswählen

source: There is already a pending request to put {manager} in charge of {client}.
de: Es gibt bereits einen ausstehenden Antrag, {manager} mit der Betreuung von {client} zu beauftragen.

source: A draft to put {manager} in charge of {client} already exists.
de: Es gibt bereits eine Anfrage, um {manager} die Verantwortung für {client} zu übertragen.

source: Client and relationship manager cannot be the same person.
de: Kunde*in und Kundenbetreuer*in dürfen nicht dieselbe Personen sein.

source: Cannot degrade primary manager. Make a primary request for a different manager instead.
de: Primäre Betreuer*innen können nicht entfernt werden. Machen Sie stattdessen einen Antrag für eine*n andere*n Betreuer*in.

source: {manager} is already in charge of {client}.
de: {manager} ist bereits für {client} zuständig.

source: Create New Call Activity
de: Erstelle eine neue Anrufs-Aktivität

source: Telephones
de: Telefonnummern

source: Addresses
de: Adressen

source: Websites
de: Webseiten

source: Bankings
de: Bankinformationen

source: Activities
de: Aktivitäten

source: Employees
de: Angestellten*Angestelltinnen

source: More Information
de: Weitere Informationen

source: Client/Manager
de: Klienten*innen/Betreuer*innen

source: New Person
de: Neue Person

source: Delete Relationship
de: Beziehung Löschen

source: <p> Are you sure you want to delete the relationship? </p>
de: <p> Sind Sie sich sicher, dass Sie diese Beziehung löschen wollen? </p>

source: Deletion
de: Löschung

source: Relationship Instance
de: Beziehungsinstanz

source: New Company
de: Neues Unternehmen

source: See Entry
de: Eintrag Einsehen

source: This is the primary {contact}. In order to delete the primary {contact} you have to specify a different primary contact or make it the only contact. To change primary status make a different contact primary instead.
de: Dies ist der primäre {contact}. Ein Primärkontakt kann nur gelöscht werden, wenn es der einzige Kontakt ist. Gibt es noch andere {contact}n, muss erst ein anderer Kontakt als Primärkontakt festgelegt werden.

source: Primary Contact
de: Primärer Kontakt

source: Street Additional
de: Straße (zusätzliches)

source: Zip
de: PLZ/ZIP

source: Institute additional
de: Institut (zusätzliches)

source: Information
de: Informationen

source: Last Activities
de: Letzte Aktivitäten

source: Activity
de: Aktivität

source: Main Information
de: Hauptinformationen

source: Primary Phone Number
de: Primäre Telefonnummer

source: Primary Relationship Manager
de: Primäre*r Betreuer*in

source: Last Activity
de: Letzte Aktivität

source: Interests
de: Interessen

source: Interested Products
de: Interessierte Produkte

source: Company Is Primary Employer
de: Unternehmen ist Hauptarbeitgeber*in

source: Position in Company
de: Position im Unternehmen

source: From
de: Von

source: To
de: Zu

source: Pending Banking Contacts
de: Ausstehende Bankkontakte

source: Search by Telephone Contact
de: Telefonnummernsuche

source: Your Contact
de: Dein Kontakt

source: Create Company
de: Unternehmen Erstellen

source: Create Person
de: Person Erstellen

source: Banks
de: Banken

source: Create Bank
de: Bank Erstellen

source: Your Clients/Prospects/Contacts
de: Deine Klient*innen/Interessent*innen/Kontakte

source: Create Relationship Type
de: Beziehungstyp Erstellen

source: Create Client Manager Relationship
de: Kunden-Betreuer-Beziehung Erstellen

source: Company Positions
de: Unternehmenspositionen

source: Create Position
de: Position Erstellen

source: Create Customer Status
de: Kundenstatus Erstellen

source: Create Company Type
de: Unternehmenstyp Erstellen

source: Create Specialization
de: Spezialisierung Erstellen

source: Show all addresses
de: Zeige alle Adressen

source: Show all activities
de: Zeige alle Aktivitäten

source: Email Contact: {{address}}
de: E-Mail-Kontakt: {{address}}

source: Email Contacts
de: E-Mail-Kontakte

source: New Email Contact
de: Neue E-Mail-Adresse

source: New Address Contact
de: Neue Adressdaten

source: Banking Contact: {{institute}}
de: Bankdaten: {{institute}}

source: New Banking Contact
de: Neue Bankdaten

source: New Email Contact for {entry}
de: Neue E-Mail-Adresse für {entry}

source: Email Contacts for {entry}
de: E-Mail-Adressen von {entry}

source: New Address Contact for {entry}
de: Neue Adresse für {entry}

source: Address Contacts for {entry}
de: Neue Adressdaten für {entry}

source: Telephone Contact: {{number}}
de: Telefonischer Kontakt: {{number}}

source: New Telephone Contact
de: Neuer Telefonkontakt

source: Telphone Contacts for {entry}
de: Telefonkontakte für {entry}

source: New Telephone Contact for {entry}
de: Neue Telefonnummer für {entry}

source: Website Contact: {{url}}
de: Website: {{url}}

source: Websites for {entry}
de: Webseite von {entry}

source: New Website Contact for {entry}
de: Neue Website für {entry}

source: Banking Contacts for {entry}
de: Bankdaten für {entry}

source: New Banking Contact for {entry}
de: Neue Bankdaten für {entry}

source: Social Media Accounts of {entry}
de: Social-Media-Accounts von {entry}

source: {platform} Account of {entry}
de: {platform}-Account von {entry}

source: New Social Media Contact for {entry}
de: Neuer Social-Media-Kontakt für {entry}

source: Company: {{name}}
de: Unternehmen: {{name}}

source: New Employee at {company}
de: Neue*r Angestellte*r bei {company}

source: Employees at {company}
de: Angestellte bei {company}

source: Employers for {person}
de: Arbeitgeber*in für {person}

source: Your Contacts
de: Deine Kontakte

source: Relationships of {entry}
de: Beziehungen von {entry}

source: New Relationship for {entry}
de: Neue Beziehung für {entry}

source: New Relationship Type
de: Neuer Beziehungstyp

source: Client Manager Relationship between {client} & {person}
de: Kunden-Betreuer-Beziehung zwischen {client} & {person}

source: Relationship Managers for {entry}
de: Betreuer*innen für {entry}

source: Clients of {person}
de: Kund*innen von {person}

source: New Client Manager Relationship
de: Neue Kunden-Betreuer-Beziehung

source: New Customer Status
de: Neuer Kundenstatus

source: New Company Position
de: Neue Unternehmensposition

source: Company Position
de: Unternehmensposition

source: New Company Type
de: Neuer Unternehmenstyp

source: New Specialization
de: Neue Spezialisierung

source: Dear {0} {1}
de: Sehr geehrte*r {0} {1}

source: Person Salutation
de: Grußformel für Personen

source: Salutation that can be used in mails for a person
de: Grußformel für E-Mails an Personen

source: To everyone from {0}
de: Sehr geehrte Mitarbeiter*innen bei {0}

source: Company Salutation
de: Grußformel für Unternehmen

source: Salutation that can be used in mails for a company
de: Grußformel für E-Mails an Unternehmen

source: Salutation
de: Grußformel
